{
  "home": "inicio",
  "about": "información",
  "work": "trabajos",
  "skills": "habilidades",
  "contact": "contacto",
  "Hello, I am": "Hola, soy",
  "Full-stack Developer": "Desarrolador Full Stack",
  "Hard Work Beats Talent When Talent Doesn't Work Hard": "El Trabajo Duro Vence Al Talento Cuando El Talento No Trabaja Duro",
  "Hi, I'm Hernan": "Hola, mi nombre es Hernan",
  "I'm a Full-stack JavaScript Developer with 3 years of professional experience. I've been building and maintaining scalable, resilient and tested code bases for enterprise applications with JavaScript since 2020.": "Soy un desarrollador JavaScript Full-stack con 3 años de experiencia profesional. He desarrollado y mantenido bases de código escalables, resistentes y testeadas para aplicaciones empresariales desde 2020 con JavaScript.",
  "I am interested in job opportunities where I can contribute, learn and grow at the same time. Regarding soft skills, I am communicative and have no problems with teamwork. If you have any opportunity for me, do not hesitate to contact me.": "Estoy interesado en oportunidades laborales donde pueda aportar, aprender y crecer al mismo tiempo. En cuanto a las habilidades blandas, soy comunicativo y no tengo problemas con el trabajo en equipo. Si se tiene alguna oportunidad para mi persona, no dude en contactarme.",
  "All rights reserved": "Todos los derechos reservados",
  "My Projects": "Mis Proyectos",
  "All": "Todos",
  "Web": "Web",
  "Mobile": "Mobile",
  "An application to create your own store made with NextJS,Typescript, TailwindCSS, NodeJS, ExpressJS, Docker and PostgreSQL": "Es una aplicación para administrar y crear tu porpia tienda en línea realizada con NextJS,Typescript, TailwindCSS, NodeJS, ExpressJS, Docker and PostgreSQL",
  "An store made with ReactJS, Typescript, SASS, Redux, NodeJS, Express and MongoDB": "Es una tienda virtual creada with ReactJS, Typescript, SASS, Redux, NodeJS, Express and MongoDB",
  "A delivery app made with React Native, Typescript, Redux, Expo, NodeJS, Express, MongoDB": "Una app de delivery realizada con React Native, Typescript, Redux, Expo, NodeJS, Express, MongoDB",
  "An tinder clon made with ReactJS, SASS, Redux, NodeJS, Express and MongoDB": "Clon de la app Tinder realizada con ReactJS, SASS, Redux, NodeJS, Express and MongoDB",
  "Skills & Experiences": "Habilidades y Experiencia",
  "Contact Me": "Contáctame",
  "Building an internal tool to manage the resources for enterprise garage companies": "Creación de una herramienta interna para gestionar los recursos de las empresas de cocheras empresariales.",
  "The tech stack used was React.js with Vite, Node with Nest.js, and AWS for deployment": "La tecnologías utilizadas fueron React.js con Vite, Node con Nest.js y AWS para la implementación",
  "Maintenance of large JavaScript codebases with more than ten thousand lines of code, implementing refactors and improving performance": "Mantenimiento de grandes bases de código JavaScript con más de diez mil líneas de código, implementando refactorizaciones y mejorando el rendimiento",
  "Development of a microservices-based management application for big companies in the sausage business": "Desarrollo de una aplicación de gestión basada en microservicios para grandes empresas del negocio de embutidos",
  "Development of an insurance's company internal tool to manage employees' referrals, the system was microservices-based due the size of the company. Node.js and Express were used": "Desarrollo de una herramienta interna de la compañía de seguros para gestionar las referencias de los empleados, el sistema estaba basado en microservicios debido al tamaño de la empresa. Se utilizaron Node.js y Express",
  "Development of landing pages and marketing sites with HTML, CSS, JS and Wordpress": "Desarrollo de landing pages y sitios de marketing con HTML, CSS, JS y Wordpress"
}
