{
  "home": "inicio",
  "about": "información",
  "work": "trabajos",
  "skills": "habilidades",
  "contact": "contacto",
  "Hello, I am": "Hola, soy",
  "Front-end Developer": "Desarrolador Full Stack",
  "Hard Work Beats Talent When Talent Doesn't Work Hard": "El Trabajo Duro Vence Al Talento Cuando El Talento No Trabaja Duro",
  "Hi, I'm Hernan": "Hola, mi nombre es Hernan",
  "Front-end developer with more than 2 years and 5 months of professional experience creating and implementing design systems with Javascript. I am qualified and familiar with a wide range of utilities and technologies in the front web development. You can see part of me work below.": "Desarrollador front-end con más de 2 años y 5 meses de experiencia profesional creando e implementando sistemas de diseño con Javascript. Estoy calificado y familiarizado con una amplia gama de utilidades y tecnologias en el desarrollo frontal de la web. Puede visualizar parte de mi trabajo a continuación.",
  "I am interested in job opportunities where I can contribute, learn and grow at the same time. Regarding soft skills, I am communicative and have no problems with teamwork. If you have any opportunity for me, do not hesitate to contact me.": "Estoy interesado en oportunidades laborales donde pueda aportar, aprender y crecer al mismo tiempo. En cuanto a las habilidades blandas, soy comunicativo y no tengo problemas con el trabajo en equipo. Si se tiene alguna oportunidad para mi persona, no dude en contactarme.",
  "All rights reserved": "Todos los derechos reservados",
  "My Projects": "Mis Proyectos",
  "All": "Todos",
  "Web": "Web",
  "Mobile": "Mobile",
  "An application to create your own store made with NextJS,Typescript, TailwindCSS, NodeJS, ExpressJS, Docker and PostgreSQL": "Es una aplicación para administrar y crear tu porpia tienda en línea realizada con NextJS,Typescript, TailwindCSS, NodeJS, ExpressJS, Docker and PostgreSQL",
  "An store made with ReactJS, Typescript, SASS, Redux, NodeJS, Express and MongoDB": "Es una tienda virtual creada with ReactJS, Typescript, SASS, Redux, NodeJS, Express and MongoDB",
  "A delivery app made with React Native, Typescript, Redux, Expo, NodeJS, Express, MongoDB": "Una app de delivery realizada con React Native, Typescript, Redux, Expo, NodeJS, Express, MongoDB",
  "An tinder clon made with ReactJS, SASS, Redux, NodeJS, Express and MongoDB": "Clon de la app Tinder realizada con ReactJS, SASS, Redux, NodeJS, Express and MongoDB",
  "Skills & Experiences": "Habilidades y Experiencia",
  "Integrated billing addition for an accounting and management software built on ReactJS and NodeJS.": "Adición de facturación integrada para un software contable y de administración construido en ReactJS y NodeJS.",
  "Development of new functionalities for the system in Frontend with ReactJs, Bootstrap, and on the Backend side, with NodeJs, Express and MySQL.": "Desarrollo de nuevas funcionalidades para el sistema en Frontend con ReactJs, Bootstrap, y por el lado del Backend, con NodeJs, Express y MySQL.",
  "Detection and solution of errors in the accounting part of the system.": "Detección y solución de errores en la parte contable del sistema.",
  "Optimization of the application in performance issues.": "Optimización de la aplicación en temas de performance.",
  "Creation of administrative panels with ReactJS and Typescript, a state managed by Redux, styles with SASS and connection to REST API created in NodeJs, Express and MySQL.": "Creación de paneles administrativos con ReactJS y Typescript, un estado manejado por Redux, estilos con SASS y conección a API REST creado en NodeJs, Express y MySQL.",
  "Optimization and maintenance of Web Apps made in ReactJS to avoid obsolete renderings.": "Optimización y mantenimiento de Web Apps realizadas en ReactJS para evitar renderizaciones obsoletas.",
  "Landing page layout built with HTML, SASS and Javascript.": "Maquetación de landing pages construidos con HTML, SASS y Javascript.",
  "Design of administrative panels with ReactJS, VueJS, SASS and Bootstrap (Frontend).": "Maquetación de paneles administrativos con ReactJS, VueJS, SASS y Bootstrap (Frontend).",
  "Contact Me": "Contáctame",
  "Development of a sales and inventory management system, with integrated electronic invoicing, branch management, statistics. Made with ReactJS, Bootstrap on the frontend and NodeJS, ExpressJS, SQLServer, Docker, AWS S2, AWS EC2 in the backend.": "Desarrollo de un sistema de administración de ventas e inventario, con facturación electrónica integrada, manejo de sucursales, estadística. Realizada con ReactJS, Boostrap en el frontend y NodeJS, ExpressJS, SQLServer, Docker, AWS S2 y AWS EC2 en el backend.",
  "Detection and solution of performance problems, obsolete renderings and performance in applications made with ReactJS.": "Detección y solución de problemas de performance, rederizaciones obsoletas y de rendimiento en aplicaciones realizadas con ReactJS.",
  "Addition of provider for card payments within the application.": "Adición de proveedor para pagos con tarjeta dentro de la aplicación",
  "Development of a sales and inventory management system, with electronic invoicing, branch management and statistics. ReactJS was used and NodeJS was used in the backend, Microsoft SQL Server as the database, Amazon S3 for uploading images and files, SendGrid for sending emails, among other technologies. The deployment was done in the AWS cloud with the help of the ECS (Elastic Container Service) and ELB (Elatic Load Balance) service, which carried out a horizontal scaling of the system.": "Desarrollo de un sistema de administración de ventas e inventario, con facturación electrónica, manejo de sucursales y estadística. Se usó ReactJS y en el backend se usó NodeJS, Microsoft SQL Server como base de datos, Amazon S3 para la subida de imágenes y archivos, SendGrid para el envío de correos, entre otras tecnologías. Se hizo el deploy en la nube de AWS con la ayuda del servicio de ECS (Elastic Container Service) y ELB (Elatic Load Balance) que relizando un escalamiento horizontal del sistema.",
  "Development of the deployment pipeline for test and production environments with the help of AWS ECR, AWS CodeBuild and AWS CodeDeploy.": "Desarrollo de pipeline de despliegue para ambientes de test y producción con la ayuda de AWS ECR, AWS CodeBuild y AWS CodeDeploy.",
  "Use of AWS Lambda for extra system functionalities, reducing workload and increasing application performance.": "Uso de AWS Lambda para funcionalidades extras del sistema, reduciendo carga de trabajo y aumentando el rendimiento de la aplicación.",
  "Development and supervision of web applications made with ReactJS, helping to improve performance.": "Desarrollo y supervisión de aplicaciónes web realizadas con ReactJS, ayudando a mejorar el redimiento y performance.",
  "Development of REST services with NodeJS and MongoDB as database.": "Desarrollo de servicios REST con NodeJS y MongoDB como base de datos.",
  "Construction of Continuous Integration workflow for various projects with AWS CodePipeline, for its subsequent deployment in EC2 instances.": "Contrucción de flujo de trabajo de Integración Continua para diversos proyectos con AWS CodePipeline, para su posterior despliegue en instancias de EC2."
}
